backend/tests/load/load-test.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Sustained load (5 users/sec)"
    - duration: 30
      arrivalRate: 5
      rampTo: 20
      name: "Ramp up load (5 to 20 users/sec)"
    - duration: 60
      arrivalRate: 20
      name: "Peak load (20 users/sec)"
  plugins:
    ensure: {}
    expect: {}
  ensure:
    maxErrorRate: 1 # Stop if error rate > 1%
    max95thResponseTime: 500 # P95 latency must be < 500ms

scenarios:
  - flow:
      - post:
          url: "/"
          headers:
            Content-Type: "application/json"
          json:
            query: |
              query GetSolutions($consumption: Float!, $state: String!) {
                getSolutions(consumption: $consumption, state: $state) {
                  supplier {
                    name
                    costPerKwh
                  }
                  savings
                }
              }
            variables:
              consumption: 2500
              state: "SP"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: data.getSolutions